INSTRUCTION = """Инструкция по регистрации бота\n1. Вы высылаете токен API в Kaspi магазине. 
Он находится в настройках магазина при входе с главного номера на котором зарегистрирован магазин. 
Он нужен нам для отслеживания статуса заказа и отправки сообщений клиентам.\n2. Мы отправляем вам QR код для сканирования
 вашим телефоном. Вам нужно пройти в раздел “Настройки” > “Связанные устройства” > “Связать новое устройство”.\n 3. Наш бот активирован,
  с этого момента ваши покупатели начнут получать сообщения в WhatsApp."""